; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	image4 - mode
	infrared5 - mode
	image3 - mode
	infrared8 - mode
	image6 - mode
	spectrograph7 - mode
	spectrograph9 - mode
	spectrograph0 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared8)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph1)
	(supports instrument1 image3)
	(supports instrument1 spectrograph9)
	(supports instrument1 image6)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared5)
	(supports instrument2 spectrograph7)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(have_image Star5 infrared5)
	(have_image Planet6 image6)
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon7 infrared8)
	(have_image Phenomenon7 infrared5)
	(have_image Phenomenon8 spectrograph9)
	(have_image Phenomenon8 image3)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon9 image3)
	(have_image Phenomenon9 infrared5)
))

)

; plan
1. (turn_to satellite0 groundstation3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 11
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite0 planet6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet6)
   goals met: 0 of 11
5. (take_image satellite0 planet6 instrument1 image6)
   added: (have_image planet6 image6)
   goals met: 1 of 11
6. (turn_to satellite0 phenomenon9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 11
7. (take_image satellite0 phenomenon9 instrument1 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 3 of 11
8. (take_image satellite0 phenomenon9 instrument1 image3)
   added: (have_image phenomenon9 image3)
   goals met: 4 of 11
9. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon8 instrument1 spectrograph9)
   added: (have_image phenomenon8 spectrograph9)
   goals met: 4 of 11
11. (take_image satellite0 phenomenon8 instrument1 image3)
   added: (have_image phenomenon8 image3)
   goals met: 5 of 11
12. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 11
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 11
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 11
15. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 5 of 11
16. (turn_to satellite0 phenomenon7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 11
17. (take_image satellite0 phenomenon7 instrument0 infrared8)
   added: (have_image phenomenon7 infrared8)
   goals met: 6 of 11
18. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 11
19. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 11
20. (turn_to satellite0 groundstation2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation2)
   goals met: 6 of 11
21. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 6 of 11
22. (turn_to satellite0 phenomenon7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 11
23. (take_image satellite0 phenomenon7 instrument2 infrared5)
   added: (have_image phenomenon7 infrared5)
   goals met: 7 of 11
24. (take_image satellite0 phenomenon7 instrument2 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 8 of 11
25. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   goals met: 8 of 11
26. (take_image satellite0 star5 instrument2 infrared5)
   added: (have_image star5 infrared5)
   goals met: 9 of 11
27. (turn_to satellite0 phenomenon9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon9)
   goals met: 10 of 11
28. (take_image satellite0 phenomenon9 instrument2 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 11 of 11
